{
    "Finnish school shooting motivated by bullying - police": {
        "Positive": [
            "Wild. The 4th safest country in the world, too.",
            "I gotta love how the second bullying became involved, everyone has completely flipped their scripts and are now venerating him for taking revenge. None of us know how severe it was or if *he even shot at the bullies*. He needs serious psychological help and punishment but shooting unarmed people isn’t okay, period. \n\nAlso if I see one more person say the Columbine shooters’ motive was bullying I’m going to start ripping my hair out. I’ve yet to learn of a shooting where ONLY bullies were hurt, every single one involved massive collateral damage; if anyone knows of one feel free to say so. \n\nYou can always tell which commenters got bullied hard enough to leave permanent trauma. That’s not even a criticism, I empathize completely, but a 12 year old boy, who could have maybe redeemed himself, is dead now. That’s not okay.",
            "Bullying a child can literaly turn them into murderers.\n\nImagine what bullying a whole country could do."
        ],
        "Negative": [
            "Actually isn't almost ALL school shootings the result of uncontrolled bullying? Oh wait I'm sorry I'm from the US so it must be goth music and video games... Yeah.. That's it.. /s"
        ],
        "Neutral": []
    },
    "New York inmates are suing to watch the solar eclipse after state orders prisons locked down": {
        "Positive": [],
        "Negative": [
            "The amount of needless cruelty in prisons and jails is ridiculous.    My local jail removes clocks etc and prohibits inmates from knowing the time around new year for example.",
            "I just feel like there's a lot of things we don't let inmates do, for no reason other than to make their time miserable."
        ],
        "Neutral": [
            "Yeah we will look into this appeal on April 9th",
            "[deleted]"
        ]
    },
    "Australian of the Year Richard Scolyer 'blown away' by success of radical new brain cancer treatment": {
        "Positive": [
            "It's incredible to see groundbreaking advancements in the fight against brain cancer. Richard Scolyer's dedication and innovation are truly inspiring. This new treatment offers hope to so many battling this devastating disease, and it's heartening to see its success recognized on such a significant platform. Here's to continued progress in the field of medical research and to the countless lives that will be impacted by this breakthrough.",
            "Yup!\n> Now, work is underway developing protocols for the start of clinical trials. If the results of those trials are strong, it could shake-up the current treatment regimen of surgery, chemotherapy and radiation that has not changed in 19 years.\n\nWe've know this for a long time.  Once you learn to use a hammer everything looks like a nail.  Good for him.",
            "This is amazing news and three cheers to Professor Scolyer and Professor Long for their contributions.   Professor Scolyer is the ultimate in practicing leading from the front.  As someone who had a good friend pass away of glioblastoma in the past year, this is one of those cancers that is largely an unavoidable death sentence at the moment.  That sounds like it's changing."
        ],
        "Negative": [],
        "Neutral": [
            "Lost my sister at 34 to a brain tumor/cancer (she chose not to have it biopsied because the location meant that it was terminal either way.). Props to this guy for working to ensure that fewer families have to go through what we did."
        ]
    },
    "New York legislature votes to abolish adultery law from 1907": {
        "Positive": [
            ">New York’s Senate on Wednesday overwhelmingly approved a bill to repeal a largely unused law from 1907 that made adultery a criminal offense. The bill, which passed the State Assembly earlier this year, now goes to New York Governor Kathy Hochul. If signed, the adultery statute will be immediately repealed.\n\nWould be nice to see more states get rid of these outdated and stupid laws before Christian nationalist politicians try to use them as swords against us.",
            "Trump: “I guess I’ll move back to New York”"
        ],
        "Negative": [
            "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n We are actively looking for new moderators.  If you have any interest in helping to make this subreddit a place for quality discussion, please fill out [this form](https://docs.google.com/forms/d/1y2swHD0KXFhStGFjW6k54r9iuMjzcFqDIVwuvdLBjSA).\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*"
        ],
        "Neutral": []
    },
    "The astonishing radicalism of Florida’s new ban on abortion": {
        "Positive": [],
        "Negative": [
            "Marijuana legalization is also on the ballot in November.\n\nIf Florida still goes red then not sure it can be saved.",
            "If you're in florida, vote. If you think your state is too 'red' or 'blue' for your vote to matter, it's not. Plenty of states have 'swapped', and undecided/non-voters could have changed just about every election in US history. And every year some contest somewhere comes down to single digit votes--or one."
        ],
        "Neutral": [
            "Might get enough people out to vote to swing the election.",
            "It’s only radicalism if it’s not your political ideaology amirite?"
        ]
    },
    "The teaching of Hmong and Asian American histories to be required in Wisconsin under a new law": {
        "Positive": [
            "Is this political? This just seems like another normal thing",
            "I went to college in Wisconsin and my one Professor was Hmong.  He told us their history and situation in the U.S. in relation to the Vietnam War and how the communities live in Wisconsin. It was something that many people don't know about in terms of war refugees and how they were basically scattered across the country far from each other. That communities like the one in Wisconsin came about due to Hmong people trying to reach out and connect with each other decades after being relocated. I am happy that this happened and that it can help inform people more about the situation of refugees and their difficulties in relocation and adjusting. I am sure my Professor is happy about this news.",
            "I wonder if they'll teach the real history, or sanitized revisionism."
        ],
        "Negative": [],
        "Neutral": [
            "that's my governor baby"
        ]
    },
    "NY state is demanding more information on Trump's $175 million appeal bond in civil fraud case": {
        "Positive": [],
        "Negative": [
            "Shit birds of a feather",
            "Maybe he has to supply financial statements that carry criminal penalties if falsified? So you go to jail if you add floors to your building."
        ],
        "Neutral": [
            "And oopsie, he gets another 10 days ....",
            "Russian money you say?"
        ]
    },
    "Judge Cannon Promises She’ll Take Her Sweet Time With This Trump Case | The judge refused to dismiss the classified documents case.": {
        "Positive": [],
        "Negative": [
            "She is incompetent and corrupt. So sick of having to pretend she is legit. Remove her.",
            "I think she's keeping her options open, if Cheeto gets jailed in another case, she will knife him. In the other case she will exonerate him for a payout."
        ],
        "Neutral": [
            "Does Jack Smith have any recourse here?",
            "She'll delay as much as possible.   The moment double jeopardy applies, then she'll unleash the kraken."
        ]
    },
    "No Labels won't run a 3rd-party 'unity' ticket against Trump, Biden": {
        "Positive": [
            "I’m thinking no labels was cannibalizing trump’s votes more than Biden votes… and somehow this 2-way race is a toss-up."
        ],
        "Negative": [
            "Nobody of relevance wants anything to do with them quite sad."
        ],
        "Neutral": [
            "No Labels died with Joe Lieberman. Womp womp.",
            "No Candidates "
        ]
    },
    "New York AG Questions if $175 Million Bond Insurer Can Save Trump": {
        "Positive": [
            "The company does not even have the capital to cover the bond. How much do you want to bet that it folds when New York tries to collect?",
            "Knight: “I dunno, I’ve never gotten this far”",
            "No matter how good a swindler Trump thinks he is, New York State and New York City have seen it all before in their long and storied history as the financial center of the world, and they are prepared for him."
        ],
        "Negative": [
            "DE-licious!\n\nI am sure that I'm not the only one who wants to see T burn.\n\nI want to see a public mental breakdown so bad, it can not be talked away.\n\nI want to see him crumble and sputter and completely lose his mind on stage.\n\nI want to see shit stains on his pants bc he shat himself in fear so badly and voluminously that his nappies just could not keep up.\n\nI want to see him utterly totally disgraced.... and then jailed for the remainder of his natural life. They do have something like dementia wards in prison, I hope.\n\nKeep up the pressure, gals and guys. He might just crack."
        ],
        "Neutral": []
    },
    "New rule strengthening federal job protections could counter Trump promises to remake the government": {
        "Positive": [
            "Only Hillary could do this as well as Biden is. An ounce of prevention is worth a pound of a cure. \n\nNow we have to keep shoring up defenses until November, when we can prepare to build back better in 2025."
        ],
        "Negative": [
            "There is nothing to stop him, except for voters turning him down"
        ],
        "Neutral": [
            "Yeah?  Well who’s going to protect the rest of us??",
            "Trump would ignore the law and fire them anyway. Then takes years to wander through courts.\n\n\nOr he fires the agency head and puts his stooge in to change rule.\n\n\nOr his GOP judges throw out the rule."
        ]
    },
    "Is Trump's $175 million civil fraud bond valid in New York?": {
        "Positive": [
            "> \"First he furnished about $120 million worth of bonds that we OK'd, so we assumed it would be investment-grade bonds and cash. But as it turned out, it was all cash,\" he told CBS News in a brief phone call on Tuesday. But Trump retained that $175 million cash collateral\n\nTotally really not sketchy at all from top to bottom.",
            "*\"But Trump retained that $175 million cash collateral, according to Shah. He said the money is in an account that is \"pledged\" to the company. He would not specify the type of account. Trump paid a premium to the company that Shah declined to disclose.\"*\n\nI'll bet it's in an account filled with Trump Social stocks.",
            "And, as usual, not a single dollar of his own money."
        ],
        "Negative": [],
        "Neutral": [
            "Anyone else notice this has turned into a defacto extension?"
        ]
    },
    "New York City’s mayor, Eric Adams, skipped a banquet honoring Taiwan’s president after a top Chinese diplomat sent him a letter warning that his attendance at the March 2023 function could cost New York its “friendship” with China.": {
        "Positive": [
            "OK."
        ],
        "Negative": [
            "China is evil in the exact same way Russia is. Americans should not feel shame or pressured to support freedom worldwide."
        ],
        "Neutral": [
            "> City Hall has not said why the mayor did not attend\n\nThat won't stop National Review from making up a conspiracy theory connecting dots with red string.",
            "Gotta save that knock off purse supply"
        ]
    },
    "New video of deadly deputy shooting giving Fontana community painful flashback": {
        "Positive": [
            "the police literally executed the victim, and want to play coy with the murder committed by the police themselves. all they had to do was not be trigger happy pricks and this child would still be alive!!!",
            "Gotta love the passive voice and dancing around the literal murder that those cops committed...  thanks NBC"
        ],
        "Negative": [
            "You know what would help ease the pain of reminders like this? Accountability for the bloodthirsty killology trained violent arm of the law.\n\nBet those cops felt really good afterwards.\n\nEdit: I've read elsewhere that none of the officers had body cams on at the time. With that information added, I'd say every officer that fired a shot is equally culpable.",
            "Sickening that they called it a “teachable moment”. Should never have happened in the first place"
        ],
        "Neutral": []
    },
    "Freight railroads must keep 2-person crews, according to new federal rule": {
        "Positive": [
            "Fantastic news! This came out of the strikes and union negotiations a couple years back.",
            "I stuck up for the railroad union during the state of the union address and got down voted to shit for it on here. I'm glad railroad workers are making headway."
        ],
        "Negative": [
            "Fucking abysmal. They need crews of at least double the minimum on most trains.",
            "Yet there used to be an engineer, conductor, brakeman, and fireman for these trains. Through the last 40 years, they have been cutting crew. These trains can be up to a mile long with 2 people in charge? Norfolk Southern is going to keep happening."
        ],
        "Neutral": []
    },
    "Fewer U.S. scientists are pursuing postdoc positions, new data show": {
        "Positive": [
            "You can get a lot more postdocs and educated individuals if the pay outweighed the costs. Seriously, I left academia due to shitty pay.",
            "You’re telling me that finishing a low-paying 5-7 year job for a 1-3 year job that *also* pays poorly and likely won’t lead to direct hire *isn’t an exciting proposition*?\n\nNo shit\n\nAt my last postdoc, the HR lady doing group onboarding seemed surprised that no one saw themselves at the job in 3 years. \n\n‘We’re a majority of the workforce. Unless you fire all of your permanent staff and make even more permanent positions, there’s no way we’re staying. It’s mathematically impossible. Why would we plan on it?’\n\nCompletely out of touch.",
            "Lets see toxic work environment, low pay, long hours, no promotion path and competitive hiring process for the best ones. Also competing against students from other countries as well. Can’t see why anyone would not want this role."
        ],
        "Negative": [
            "I'm disappointed but not at all surprised."
        ],
        "Neutral": []
    },
    "Cold Cases, Officials Keeping Bodies for ‘Personal Collections’ Spurred Push For New Law": {
        "Positive": [
            "> “rouge anthropologists” across the country would keep the human remains of people who could not be positively identified. Some would even use them for educational purposes or for “their own personal collections,” \n\nThat’s some serial killer bullshit right there. You could probably solve a few cold cases by investigating these “rogue anthropologists.”",
            "Proper handling and respect for human remains is a basic matter of dignity. Any allegations of remains being improperly kept or mistreated rightfully deserve a full and transparent investigation. Stronger legal protections around deceased persons seem warranted."
        ],
        "Negative": [
            "Hmm.. if you were a cold case murder victim, would you prefer that your remains were treated in a dignified way that eliminated the evidence that might, one day, provided evidence for a prosecution?"
        ],
        "Neutral": [
            "There is no monstrosity white men will not commit."
        ]
    },
    "Biden tells Israel's Netanyahu future US support for war depends on new steps to protect civilians": {
        "Positive": [
            "[Biden Administration Presses Congress on $18 Billion Sale of F-15 Jets to Israel](https://www.nytimes.com/2024/04/02/us/politics/biden-israel-weapons-deal.html#:~:text=Al%2DShifa%20Hospital-,Biden%20Administration%20Presses%20Congress%20on%20%2418%20Billion%20Sale%20of%20F,the%20war%20in%20Gaza%20rises.)\n\n[US recently authorized thousands more bombs for Israel](https://www.cnn.com/2024/04/04/politics/us-israel-bombs-transfer/index.html)\n\nBoth of these articles are from **this week**. This is nothing but lip service. Biden will continue to arm Israel. More civilians are going to be killed, and nothing is going to change from this administration on this."
        ],
        "Negative": [
            "Netanyahu wants his puppet Trump back in office and is doing whatever he can to make Biden look weak.",
            "It took over 30,000 bodies and the targeting of some western activists to even get him a little tough on Israel. Biden is potentially throwing everything away to support death and destruction"
        ],
        "Neutral": [
            "Not if these people hand Trump the presidency we are so screwed. I’m all for this but you have some saying the won’t vote for Biden come November. Screw the rest of us here them"
        ]
    },
    "Judge rejects Donald Trump’s request to delay hush-money trial until Supreme Court rules on immunity": {
        "Positive": [
            "Nobody is above the law. If SCOTUS allows this, it’s going to set a precedent we will never escape. A leader free of consequences is not a democratic leader. It’s a dictator.",
            "Judge rejects Trump swiftly and with visible disgust. Just the way most of the women did when he asked them for their number. \n\n\n\nThere, I tweaked the headline a bit. "
        ],
        "Negative": [
            "You can fuck right of with your \"immunity\", Donnie."
        ],
        "Neutral": [
            "How would he have presidential immunity if this all happened before he was ever elected president?"
        ]
    },
    "Judge rejects Donald Trump's request to delay hush-money trial until Supreme Court rules on immunity": {
        "Positive": [
            "He is going to have that breakdown soon. Next week is gonna be a full ass firehose of shit. Think he will go Weinstein?"
        ],
        "Negative": [
            "Really hard to understand why all these judges are so uncooperative given how polite and accommodating P01135809 has been towards them and their families and colleagues",
            "Please let this case result in him seeing jail time."
        ],
        "Neutral": [
            "Rage tweet or whatever is coming. Claiming his rights are being violated by a tRump hating judge and his daughter. And throw in witch hunt and election interference while he's at it.... of course, all IN CAPS!"
        ]
    },
    "Judge in Trump hush money case rejects attempt to delay trial with immunity defense": {
        "Positive": [
            "And so it FINALLY begins. Rejoice, friends, the  fall of Donald J. Trump is starting on april 15th. :)",
            "Bear in mind - Going after a person's wallet is a strong strategy, especially for a narcissist like Trump. And exposing his lack of wealth.\n\nWe should also consider the emotional and physical toll this has taken on him and will continue to take on him.\nIf the hush money trial goes ahead (I'm crossing my fingers) Trump will be forced to hear the testimony of his enemies. Just think about what Stormy is going to say about him - he will be emasculated."
        ],
        "Negative": [],
        "Neutral": [
            "If Trump manages to win any of his immunity claims, who would dare work for him in a possible second term? He could just shoot a random Secretary on a slow day and claim the same immunity.",
            "Next trump will try the immaturity defense. He may get somewhere with it."
        ]
    },
    "Judge denies Trump’s motion to delay NY hush money trial until Supreme Court rules on presidential immunity": {
        "Positive": [
            "Maybe the court will magically expedite a decision on immunity...to pad their retirement fund..."
        ],
        "Negative": [
            "Well this has to with election interference not his time in the White House, so I can see why the judge would not wait for SC for something that has no bearing on the case at hand. Now I long for the day trump will be silent and faded away from view of the world only  to be a footnote in the pages of history"
        ],
        "Neutral": [
            "Why would he get presidential immunity for things he claims he never did?",
            "Prediction: further breaking news,  Supreme Court rules judge can’t deny motion to delay"
        ]
    },
    "Fox News Goes After Judge in Trump’s Hush-Money Trial for Him - Donald Trump may be limited by a gag order, but Fox News isn’t.": {
        "Positive": [
            "And they think this will win over voters? ",
            "Jesse Watters is truly one of the most vile pieces of shit this nation has produced",
            "> “The judge is threatening to put Trump in jail by pointing out that his liberal family is getting rich off this trial,” Fox host Jesse Watters said Tuesday night. “He just wants a new judge—one whose family isn’t funded by Democrats.”\n\nAnd we want a new judge in the documents case that wasn't appointed by the effing defendant.\n\nSucks right?"
        ],
        "Negative": [],
        "Neutral": [
            "Fox News: for fascists by fascists."
        ]
    }
}