{
    "I'm an anthropologist who studies the origins extremism, political violence and genocide as well as paths to conflict resolution. I did fieldwork for many years in Cambodia before turning to more recently to do research on the United States. AMA!": {
        "Positive": [
            "How much of a role does Social Media play in radicalization? and is that role more of a result of people isolating themselves within an echo chamber, or is it more algorithm fed and manipulated?",
            "Hi Alex! \n\nI’d love to know your key takeaways from CPAC and dealing with MAGA. Anything that surprised you at all? \n\nThanks for what you do. All the best.",
            "Do you think the UN definition of genocide should be revised? I'm sure you're aware of the Soviet Union's role in keeping class factors out of the definition, which means on the face of it, the Cambodian Genocide didn't meet the definition (although political factors means it was defined as such later). Also the 'in part' issue - that surely makes the definition incredibly broad as to become almost useless?",
            "I'm curious about what things you see that give you hope for America these days?\n\nThe more I pay attention the more parallels I see to really bad situations in history (the leadup to Nazi party rule, the kind of language used around multiple genocides, the exponential rate of growth in misinformation/AI/deepfake stuff, etc).  And I find myself getting quite bogged down in these things and getting more and more worried.  So what, if anything, gives you a sense of hope and optimism that America can survive and thrive in the face of things like Project 2025, political polarization, and radicalization?",
            "Hello, thanks for doing this. As someone interested in anthropology myself, it's good to see anthropologists out there!\n\nI'm wondering what your thoughts are on the relationship between far-right extremist ideology and religious fundamentalism in the US, especially the heavy focus on the eschatological elements of American Christianity. Some parts of the QAnon movement certainly echo some variety of messianism, and that's basically never gone well for anyone involved.",
            "It seems to me that a lot the reasons that people give for their opinions are confabulation.  It's not that they are lying, rather it is that don't actually know why they believe what they believe.\n\nI'll give two examples.  Trump supporters say that the Trump is the legitimate president because election fraud result in an illegitimate win for President Biden.  But this is not actually why they think the election is illegitimate.  \n\nTrump supporters believe the election was stolen because Trump won the white vote.  In their \"tacit\" view, America is a white country and \"real\" Americans are white.  If the winner of the presidential election did not get a majority of votes from \"real\" Americans, the vote cannot be legitimate.  \n\nI think that this logic is largely unconscious.  Almost like our tacit knowledge of grammar produces a sentence without our necessarily understanding why the words are arranged as they are, our unconscious ideas about race and identity produce results we then confabulate reasons for.\n\nA second example is abortion.  Abortion opponents claim that person-hood is established at the moment of conception, and this is why abortion should be a crime.  But this is not the reasoning that they actually use, as the IVF case shows.  IVF inevitably produces unusable fertilized eggs that must eventually be destroyed, but abortion opponents are in favor of allowing this to happen but not abortion on demand. Why?\n\nThe difference between the cases is the intention of the mother, not the professed person-status of the fetus.  IVF involves women who want to be mothers, while most abortions cases are the reverse.  Anti-abortion efforts are meant to target (punish) women who are sexually active but do not want to  be mothers.  So IVF is okay, but abortion on demand is not, and the person-hood of the fetus doesn't enter into it all.\n\nI raise the question of coherence in political reasoning because I suspect that political reasoning is, in fact, coherent, even if the reasons people give are not.  This is relevant to the question of political violence and extremism because we often rationalize violence and extremism with incoherent arguments.  \n\nUnmasking the tacit beliefs that underpin political violence could be one means of pushing back against it because the tacit reasons are tacit *for* a reason. The tacit reasons are in some way ego-alien and threaten the coherence of the person's identity by conflicting with other beliefs. And that could force a change.",
            "What role does egalatarianism play in the formetting of extremism? \n\n\nEverytime an AMA comes up from a reporter or news org and they are asked about why they go so easy on extremists, their response is something to the effect of \"we are reporting news as it happens and both sides deserve equal representation\". \n\n\nI find this to be a cop out and bullshit. For example, a new organization running a story about if climate change is man made. On air they will have one guy for and one against. In the papers it will be an opinion article for and an opinion article against. This does not reflect the actual consensus on the topic when 97% of the experts in the field believe climate change is man made. Presenting the topic as equal does no favours to their viewers. \n\n\n> Anti-intellectualism … first got its strong grip on our ways of thinking because it was fostered by an evangelical religion that also purveyed many humane and democratic sentiments. It made its way into our politics because it became associated with our passion for equality. It has become formidable in our education partly because our educational beliefs are evangelically egalitarian. Hence, as far as possible, our anti-intellectualism must be excised from the benevolent impulses upon which it lives by constant and delicate acts of intellectual surgery which spare these impulses themselves.\nRichard Hofstadter, Anti-Intellectualism in American Life (1963), pp. 22-23",
            "It seems strange to me that while Americans feel (and are told we are) more and more extremely polarized in our political differences, at the same time the country seems very evenly divided between the two positions/parties. Is that a coincidence, or is there something else at play that keeps the parties quite balanced on a national level? I'm thinking about presidential elections coming down to just a relatively few votes, for instance.",
            "Would the adoption of ranked-choice voting or STAR voting ease our polarization? I imagine that changing the system to give third parties a fair shot would lead to the existence of popular moderate parties.",
            "Thank you for the important work you're doing. How do you process the emotional weight of doing such challenging fieldwork? Are there any remarkable instances of perpetrators/extremists who through your work changed their views or actions for the better?"
        ],
        "Negative": [
            "How do you deal with people who have become radicalized to the point where they actively disregard reality because it conflicts with their world view?",
            "I'm a little early but hope you will field this question.  Will a defeat of Trump in the 2024 election have any impact on the rise of what those of us in the center or left feel are extremist views (rolling back women's rights, homophobia, anti-immigrant, and authoritarianism - though your article says the CPAC crowd feels this is an overblown concern)?  And if Trump is elected, do you feel the US will go down an irreversible path toward authoritarianism?\n\nThank you.",
            "What is really the definition of extremism? Different people have different opinions, so what makes an opinion extreme compared to other people? Is it inherently bad? Thanks.",
            "i'm wondering if you see a connection in the rise of extremism in america to political gaslighting and mental illness.  i read an article in \"psychology today\" several years ago that cited a survey of psychiatrists who estimated that 1 in 4 americans were clinically paranoid, which was a marked increase.  at the time, another unrelated survey found that 25% of the population self identified as republican.  \n\ni contacted the writer of the article, a psychiatrist who's name i can no longer recall and asked if they were seeing any evidence of, or if they suspected, that one political party was gaslighting it's base with fear-mongering, and if so, could that party be making it's base clinically paranoid.  he answered that they were seeing a connection but that for ethical reasons, they couldn't come right out and say it.  since then (this was approximately 17 yrs ago) i feel i see a connection between mental illness (especially paranoia) and the drastic rise in extremism.  do you feel that one political party has been targeting the mentally ill and could be largely responsible for the rise in extremism?  and if so, do you see anyway in your studies for this to be reversed."
        ],
        "Neutral": []
    },
    "New York inmates sue to watch the solar eclipse after prisons ordered locked down": {
        "Positive": [
            "> Inmates in New York are suing the state corrections department over the decision to lock down prisons during next Monday's total solar eclipse.\n\n> The suit filed Friday in federal court in upstate New York argues that the April 8 lockdown violates inmates' constitutional rights to practice their faiths by preventing them from taking part in a religiously significant event.\n\n> The plaintiffs are six men with varying religious backgrounds who are incarcerated at the Woodbourne Correctional Facility in Woodbourne. They include a Baptist, a Muslim, a Seventh-Day Adventist and two practitioners of Santeria, as well as an atheist.\n\nHuh I must have missed the \"Jesus wants us to see a solar eclipse\" portion of Sunday school.\n\nCorrect me if I'm wrong but I don't recall \"seeing a neato spiffy keen solar eclipse\" being a tenet of the Muslim faith, either.\n\nSanteria, though -- yeah, they may have a case.",
            "The one thing I know about prison is you lose privileges. The one thing I know about US prisons is that they are nothing more than a bandaid and rarely rehabilitate anyone.\n\nI would think treating someone like a person and allowing them access to awesome inspiring events especially could have a positive effect on their motivation to get out. Assuming they have demonstrated the ability to currently play well with others currently.",
            "There are plenty of faith backgrounds that believe higher powers communicate through the sun, moon and stars.\n\nIt’s not the act of watching that their religions state to do, it’s that they would be missing a medium and way that their higher power communicates.",
            "I hope they intend to provide them with protective eyewear, ffs.\n\n\nI don't know the purpose for the lock down, but this seems over the top."
        ],
        "Negative": [
            "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n We are actively looking for new moderators.  If you have any interest in helping to make this subreddit a place for quality discussion, please fill out [this form](https://docs.google.com/forms/d/1y2swHD0KXFhStGFjW6k54r9iuMjzcFqDIVwuvdLBjSA).\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "I really want to go to Buffalo for it but the prices for MOTELS are insane. I’m not paying $600 for a night lmao."
        ],
        "Neutral": []
    },
    "How a California billionaire known for auto loans provided Trump’s bond": {
        "Positive": [
            "Letting these predators become so rich in the first place is the root of so many of our problems.",
            "I can’t believe that people are still loaning him money. I know it’s for a favor if he wins again, but he still has a solid history of not paying",
            "As former president [Donald Trump struggled last month to post a bond for more than $450 million](https://www.washingtonpost.com/politics/2024/03/18/trump-civil-fraud-judgment-bond-450-million/?itid=lk_inline_manual_2) to keep authorities from seizing his properties, California billionaire Don Hankey and his wife, Debbi, started discussing a solution: Hankey’s business could cover it.\n\nHankey, a Trump supporter who made a fortune providing high-interest auto loans to customers with poor credit, soon reached out to Trump’s team to negotiate a deal that would allow Trump to stay the penalty while he appealed a massive New York civil fraud judgment. But when a court reduced the bond to $175 million last week and Trump said he had the cash to post it himself, the matter seemed moot, Hankey told The Washington Post.\n\nThen, to his surprise, the Trump team last week revived the talks and asked Hankey if he would back the new amount. Hankey promptly agreed. He said that his company is charging Trump a “modest fee,” which he declined to disclose, and that the arrangement allowed Trump to hold onto his money, adding, “At least he’s getting interest on his collateral.”\n\nWith [the bond, which Trump posted Monday](https://www.washingtonpost.com/national-security/2024/04/01/trump-new-york-bond-175-million/?itid=lk_inline_manual_8), Hankey appears to have facilitated a final step in Trump’s narrow escape from a cash crunch that a few weeks ago had the New York attorney general vowing to come after his assets and experts wondering if he would have to file for bankruptcy as he faced more than half a billion dollars in penalties from two civil cases, with only weeks to find the money.\n\nThe financial boost for the presumed GOP nominee has thrust Hankey into the midst of a presidential campaign, bringing a new national profile to a colorful 80-year-old worth $7.4 billion, according to Forbes, who worked his way from car salesman to major player in the car loan industry and owner of Xanadu, formerly Olivia Newton-John’s Malibu estate. If Trump is elected, their relationship could come under new scrutiny if the government is involved in matters affecting Hankey’s business.\n\n**Read more:** [**https://www.washingtonpost.com/politics/2024/04/02/don-hankey-trump-bond-175-million-california-auto-loans/?utm\\_campaign=wp\\_main&utm\\_medium=social&utm\\_source=reddit.com**](https://www.washingtonpost.com/politics/2024/04/02/don-hankey-trump-bond-175-million-california-auto-loans/?utm_campaign=wp_main&utm_medium=social&utm_source=reddit.com)",
            "It is a bribe, pure and simple. Anyone who loans Trump money at this point knows full well that they will never see a penny of it again. I am sure he had a list of legislative/regulatory demands. The only thing that makes me feel a little better is that Trump is just as likely to not do anything he promised as he is to not pay back the money he promised",
            "Isn’t the story here that the Trump family lied and used the lie to raise money from middle class voters. \n\nThey claimed that everyone laughed at them and no one would do a Bond that big. **This guy wants, he said he was talking to them about the $475 million bond, then Trumps lawyers got the Bond reduced and they stopped talking. Then Team Trump asked if they would do the $175 million bond which he did.**\n\nWhat we know :\n\n1 - they could have found a bond for $475 million they lied about that to milk donors and manipulate the court. \n\n2 - the claim they had $500 million on hand but had to ask a sub prime lender for $175 million is odd\n\n3 - this guy won’t get paid back\n\n4 - the legal system has two tiers"
        ],
        "Negative": [
            "A guy that wants to charge unlimited interest on loans he provides donating to a presidential campaign essentially..  what could go wrong?",
            "I picture this guy sitting down with Trump and a sheet of paper with four squares on it.",
            "Is someone down there creating a list of Trump-enabling businesses we can all boycott?"
        ],
        "Neutral": [
            "It’s not a loan. It’s payment for future services and favors. ",
            "He just bought himself a seat in trump's White House cabinet, Secretary of Corruption.",
            "This guy is gives subprime auto loans, and says he repossesses about 450 cars a day.\n\nMorning Joe said that Trump was bailed out by a repo man.",
            "Quid pro quo.",
            "Giving aid to an insurrectionist.  Seize that terrorists money too.",
            "Predatory auto loan company (which actually fits into Trump’s swamp). He did a DeVos."
        ]
    }
}